[" &gt;&gt; GOOD AFTERNOON EVERYBODY. ", " I'M GOING TO DO A CALL TO  ORDER. ", " THIS IS THE SEATTLE PARK  DISTRICT BOARD ON NOVEMBER 18. ", " MY NAME IS DEBORAH JUAREZ AND I  AM PRESIDENT OF THE BOARD. ", " CLERK, CALL THE ROLE. ", " &gt;&gt;  HAROLD, HERBOLD, O'BRIEN,  PACHECO, AND PRESIDENT JUAREZ. ", " SIX PRESENT. ", " &gt;&gt; THANK YOU. ", " WE WILL MOVE INTO APPROVAL OF  THE AGENDA IF THERE IS NO  OBJECTION. ", " THE AGENDA WILL BE A DOCTOR  AND. ", " THE AGENDA IS ADOPTED.  ", " DO I SIGN THAT NOW? ", " NO, I SIGN THAT LATER. ", " SORRY ABOUT THAT. ", " I WAS LOOKING AT THE WRONG  ITEM. ", " I APOLOGIZE. ", " TODAY WE WILL HAVE A  PRESENTATION FROM THE  DEPARTMENT OF PARKS AND  RECREATION ON THE 2019 PARK  DISTRICT ACTIVITIES AND  FINANCIALS. ", " I BELIEVE IT IS A SEVEN-PAGE  POWERPOINT. ", " THIS WILL BE FOLLOWED BY A  PUBLIC HEARING TO ACCEPT  COMMENTS ON REVENUE SOURCES FOR  THE 2020 OPERATIONS BUDGET AND  A POTENTIAL TAX LEVY INCREASE  IN 2020. ", " THIS IS SEPARATE FROM OUR  TRADITIONAL PUBLIC COMMENT  PERIOD AT THE START OF THE  COMMITTEE. ", " RELATED TO GENERAL PARKS ISSUES  AND ITEMS ON THE AGENDA. ", " SO WITH THAT, I WILL NOW GO TO  APPROVAL OF THE MINUTES. ", " THE MINUTES OF THE JUNE 24, 2019 SEATTLE PARK DISTRICT BOARD  MEETING HAVE BEEN REVIEWED. ", " IF THERE ARE NO OBJECTIONS, THE  MINUTES WILL BE SIGNED. ", " HEARING NO OBJECTION, THE  MINUTES WILL BE SIGNED. ", " THERE YOU GO. ", " SO A FRIENDLY REMINDER, WE HAVE  AN INTERESTING AGENDA OF HOW  WE'RE GOING TO DO THIS DAY  BASED ON THE PUBLIC HEARING WE  HAVE COMING UP, SO A FRIENDLY  REMINDER, THOSE WHO SIGNED UP,  IF YOU WISH TO COMMENT  SPECIFICALLY ON REVENUE SOURCES  FOR THE 2020 OPERATIONS OR A  POTENTIAL PROPERTY TAX LEVY,  PLEASE SIGN IN FOR THE PUBLIC  HEARING, WHICH IS DIFFERENT  THAN PUBLIC COMMENT, WHICH WILL  CONVENE AT THE END OF THE  AGENDA. ", " HOW MANY PEOPLE DO WE HAVE  SIGNED UP JODI? ", " &gt;&gt; I ONLY HAVE PUBLIC HEARING. ", " &gt;&gt; NO ONE SIGNED UP FOR PUBLIC  COMMENT? ", " IT IS ON THE WRONG LIST. ", " &gt;&gt; WE HAVE ONE PERSON SIGNED  UP. ", " TWO FOR PUBLIC COMMENT. ", " OKAY. ", " I WILL HAVE JODI, CALL THEIR  NAMES. ", " &gt;&gt; I APOLOGIZE FOR SIGNING UP  ON THE WRONG FORM. ", " &gt;&gt; WE HAVE TWO MINUTES. ", " YOU KNOW HOW IT WORKS. ", " GO AHEAD. ", " &gt;&gt; I RECENTLY RETIRED FROM A 46  YEAR CAREER WITH SEATTLE PARKS  AND RECREATION RIGHT DIRECTED  STAFF WITH THE DEVELOPMENT OF  HUNDRED OF PARKS FACILITIES  AND MANAGE THE ACQUISITION OVER  850 ACRES OF PARKLAND. ", " HERE TODAY BECAUSE PEOPLE OF  SEATTLE LOVE THEIR PARKS. ", " FIVE YEARS AGO VOTED TO APPROVE  A METROPOLITAN PARK DISTRICT TO  PROVIDE ADDITIONAL TAX DOLLARS  TO MAINTAIN AND OPERATE OUR  PARKS AND REQUIRE MORE  PARKLAND. ", " IN 1967 CITIZEN SUPPORTED THE  KING COUNTY TRUST BOND ISSUE  $100 MILLION FOR THE PARKS AND  REQUISITION FACILITIES. ", " SINCE THAT TIME THEY VOTED OR  SUPPORTED SIX INITIATIVES THAT  VARIOUSLY PROTECT THE PARKS. ", " NEW AQUARIUM ECKEL THE GARDENS,  EXPANSION OF THE ZOO, GOLF CARS  AND DISCOVERY PARK, NO FENCE  AROUND THE WASHINGTON PARK, AND  MOST SIGNIFICANTLY, IN 1994  INITIATIVE 42 PROTECT OUR PARKS , BUT I PROHIBITING THE NON- PARK USE OF PARKLAND, AND YET  THERE'S CURRENTLY A CITY  DEPARTMENTAL TASK FORCE FORMED  TO CONSIDER THE USE OF CITY- OWNED GOLF COURSES FOR \"NON- PARK USES.\" ", " EXACTLY WHAT I 42, AND ORDINANCE 118477 WAS PASSED TO PROHIBIT. ", " ADDITIONALLY, PARTS OF AND  ASKED IF THEY HAVE POTENTIAL  NEEDS THAT WOULD REQUIRE REAL  ESTATE. ", " ARE PARKLANDS NOW JUST REAL  ESTATE? ", " 1989 KING COUNTY OPEN SPACE  BOND ISSUE WHICH PROVIDED $50  MILLION FOR NATURAL TRAILS IN  SEATTLE WITH A 72% FAVORABLE  VOTE HAVING FAILED THE YEAR  BEFORE, ELECTED LEADERS  INCLUDED FUNDING FOR A  DEVELOPMENT PROJECT INSTEAD OF  ACQUISITION. ", " MOST RELEVANT TO THE ISSUE AT  HAND, TODAY, MY ISSUE OF USE OF  PARKLAND WAS THE $198 MILLION  2000 PRO PARKS LEVY WHICH  FOLLOWED A MAJOR NEIGHBORHOOD  PLANNING EFFORT WHERE FOR THE  FIRST TIME NEIGHBORHOODS CAME  TO TERMS WITH THE NEED TO  ACCOMMODATE ADDITIONAL DENSITY. ", " THE STRUGGLE WE HAVE TODAY. ", " IF MITIGATED BY THE PROVISION  OF ADDITIONAL PARKS AND OVER  SPACE, WHICH THAT LEVY THEN  FUNDED, WHY NOW WILL BE  CONSIDERED GIVING UP PARKLAND  WHILE CONTINUING TO ADD THAT  DENSITY? ", " I REALIZE WE HAVE THE HOUSING  CRISIS. ", " SEATTLE CITIZENS WILL NOT LET  THAT HAPPEN, NOR SHOULD YOU. ", " NEVER UNDERESTIMATE THE IMPACT  OF A POOR DECISION. ", " THANK YOU VERY MUCH. ", " &gt;&gt; THANK YOU SIR. ", " &gt;&gt; WHO WAS NEXT? ", " &gt;&gt; HARPER, THE QUEEN ANNE  COMMITTEE COUNSEL WHERE HE  SERVED AS THE CHAIR OF THE  PARKS COMMITTEE NOW FOR 18  YEARS. ", " I BEEN A CITIZEN ACTIVIST FOR  PARKS FOR OVER 20 YEARS. ", " ONE OF MY ACCOMPLISHMENTS WAS  THE PURCHASE OF SMITH COVE  PARK. ", " I WORKED ON THAT SINCE 1997. ", " WE FINALLY ACCOMPLISHED THAT. ", " SO I HAVE BEEN DOING THIS FOR  QUITE SOME TIME. ", " I AM INCREDIBLY DISTURBED THAT  THERE IS EVEN A THOUGHT IN THIS  SEATTLE CITY COUNCIL HEAD THAT  YOU ARE GOING TO SELL PARKS  PROPERTY. ", " IF YOU FEEL LIKE A PARK IS  UNDERPERFORMING, SUCH AS THE  GOLF COURSE, I HAVE AN IDEA. ", " WE HAVE A CRUSHING NEED FOR  MORE SPORTS FIELDS. ", " WE NEED A MOUNTAIN BIKE COURT,  WE NEED WALKING COURTS, WE NEED  AN OFF LEASH AREA THAT ACTUALLY  WORKS FOR THE 172,000 DOGS OUT  THERE AND ALL THE HUMAN BEINGS  ON THE OTHER END OF THE LEASH. ", " TO UNDERSTAND WHAT I'M SAYING? ", " WE DO NOT HAVE ENOUGH PARKS. ", " THE REASON I 42 AND THE  ORDINANCE THAT YOUR PAST  PREDECESSORS PAST IN ORDER TO  PROTECT PARKS WAS BECAUSE THE  CITY OF SEATTLE LOVES PARKS. ", " SHOULD YOU PROCEED AND TRY TO  SELL OR CHANGE THE USE OF ANY  OF OUR PARKS, I WILL GET  INVOLVED IN CREATING AN  INITIATIVE TO MAKE AN AMENDMENT  TO THE CITY CHARTER THAT WILL  PERMANENTLY PROTECT OUR PARKS  FROM SUCH FOOLISHNESS. ", " SO PLEASE, WE NEED OUR PARKS,  WE HAVE A LOT OF USES FOR THEM. ", " LET'S KEEP THEM. ", " THANK YOU. ", " &gt;&gt; THANK YOU. ", " I BELIEVE THAT ENDS PUBLIC  COMMENT. ", " OKAY. ", " THANK YOU FOR PEOPLE  PARTICIPATED TODAY. ", " WE WILL MOVE ON TO THE ITEMS OF  BUSINESS. ", " &gt;&gt; AGENDA ITEM 1, 2019 SEATTLE  PARK DISTRICT ACTIVITIES,  FINANCIALS AND CUMULATIVE  FINANCIAL UPDATE. ", " &gt;&gt; I SEE OUR PARTICIPANTS ARE  ALREADY AT THE TABLE. ", " I WILL LET YOU INTRODUCE  YOURSELVES, INCLUDING YOU, AND  THEN WE WILL GO THROUGH YOUR  PRESENTATION. ", " &gt;&gt; STAFF TO COUNCILMEMBER  JUAREZ. ", " &gt;&gt;  TRACI RATZLIFF, COUNSEL  CENTRAL STUFF, TRAN40, SEATTLE  PARK AND RECREATION. ", " &gt;&gt; THANK YOU BOARD MEMBERS. ", " I AM GOING TO BEGIN WITH GIVING  YOU AN OVERVIEW OF SOME OF HER  2019 ACTIVITIES. ", " JUST AS A REMINDER. ", " AS YOUR BOARD MEETS TWICE A  YEAR IN JUNE AND NOVEMBER, THE  LAST TIME WE WERE BEFORE YOU WE  PRESENTED OUR 2018 FINAL REPORT  OF FINANCIALS AS WELL AS OUR  ACTIVITIES. ", " THIS IS A YEAR TO DATE REPORT  FOR 2019 WHEN WE RETURN IN 2020  IN JUNE WE WILL THEN PROVIDE  SOME OF OUR FAMILY MEMBER  THAT'S FINE NO 2019. ", " THE WAY WE'RE GOING TO GO  THROUGH THE PRESENTATION IS  THROUGH HIGHLIGHTS OF THE FOUR  MAJOR CATEGORIES OUTLINED IN  THE INITIAL FINANCIAL PLAN AND  THOSE ARE THE FIX IT FIRST,  BUILDING FOR FUTURE,  MAINTAINING PARKS AND  FACILITIES, AND PROGRAMS FOR  PEOPLE. ", " WE WILL JUMP INTO THOSE. ", " THE FIRST TALKS ABOUT THE FIX  IT FIRST CATEGORY, WHICH IS  REALLY INCLUDING THE MAJOR  MAINTENANCE, ASSET MANAGEMENT  ON THE CAPITOL SIDE AND THAT  SMALL OPERATING PIECES FOR A  TREE CREW AND OPERATION  SUPPORT. ", " THIS IS THE BULK OF THE FUNDING  AS PART OF THE FIRST SIX YEAR  CYCLE IN THE PARK DISTRICT. ", " THIS IS WHERE WE WERE REALLY  TASKED WITH ADDRESSING THE  DEFERRED MAINTENANCE IN THE  CITY. ", " 70 HIGHLIGHTS IN THE MAJOR  MAINTENANCE SIDE OF THINGS, WE  COMPLETED TO DATE IN 2019, 2020  PROJECTS, 10 OF THEM UNDER  CONSTRUCTION. ", " THESE PROJECTS RANGE FROM  EVERYTHING TO IRRIGATION WORK,  A PLAY AREA RENOVATION AT PUGET  BRIDGE IN WALLINGFORD, SOME  POOL RENOVATIONS SOUTHWEST AND  MEADOWBROOK. ", " PART OF THIS CATEGORY ALSO  INCLUDES THE REMOVAL OF  ENCROACHMENTS ON PARKS AND  úRECREATION PILOT PROPERTY, IN  2019 WE REMOVED 11 AND ALSO  BROUGHT IN 21 POINT FOR NEW  ACRES OF URBAN FOREST INTO  RESTORATION UNDER THE GREEN  SEATTLE PARTNERSHIP. ", " THE MAINTAINING PARKS AND  FACILITIES CATEGORY IS REALLY  ABOUT THINGS LIKE PEAT PATCHES,  OFF LEASH AREAS AND SOME  ADDITIONAL PREVENTIVE  MAINTENANCE PROGRAMS AND  ENHANCED PROGRAMS FOR CLEANING  PARKS AND COMMUNITY CENTERS. ", " SOME HIGHLIGHTS, AS YOU MIGHT  RECALL, IN THE PAST WE'VE  TALKED ABOUT A THIRD SHIFT WE  ADDED AS PART OF THE PARK  DISTRICT THAT ALLOWS SOME OF  POWER TRAYS TRADES AND MAKE THE  SCREWS TO GO IN A COUPLE OF  WEEKS IN THE EVENING AFTER  CLOSE TO ALLOWING US TO  MAINTAIN OPERATIONS AND ALLOWS  US TO DO SOME DEFERRED  MAINTENANCE. ", " SO IN 2019 WE ADDRESSED TO  THOSE NEEDS IN 15 COMMUNITY  CENTERS. ", " WE ALSO HAVE AN ENHANCED  CLEANING CREW ON THE PARKS AND  ENVIRONMENT SIDE THAT DID WORK  AT 61 LOCATIONS IN 2019 SO FAR. ", " IN TERMS OF OUR OFF LEASH  AREAS, THE FUNDING WE HAVE IN  THE PARK DISTRICT IS REALLY TO  ADDRESS SOME OF THE MAJOR NEEDS  THEY ARE FROM A FACILITY  STANDPOINT. ", " WE'VE GOT THREE OFF LEASH AREA  PROJECTS THAT WERE COMPLETED,  AND WE HAVE GOT PLANNING AND  DESIGN FOR FIVE OF THOSE, FIVE  ADDITIONAL SITES. ", " AND THEN FINALLY ON THE SLIDE  FOR P PATCHES, WE HAVE FIVE  GARDENS WITH PLANNING AND  DESIGN WORK UNDERWAY AND WILL  CONTINUE TO IMPROVE THOSE  PROPERTIES. ", " PROGRAMS FOR PEOPLE SUPPORTS  THE SERVICES SUCH AS OUR  COMMUNITY CENTER OPERATIONS  LIFELONG RECREATION, SPECIAL  POPULATION PROGRESS, GET  MOVING, A LOT OF OUR PROGRAMS. ", " SOME HIGHLIGHTS HERE, IN  COLLABORATION WITH THE OFFICE  OF ARTS AND CULTURE, WE HAVE  GRANTS PROGRAM CALLED ARTS IN  THE PARKS AND IN 2019 FUNDED 27  EVENTS, INCLUDING SEVEN  CONTEMPORARY ART INSTALLATIONS  COMPLETED IN THE PARKS. ", " ON A SPECIALIZED PROGRAMS THIS  INITIATIVE REALLY SUPPORTS  ADDITIONAL PROGRAMS FOR  SPECIALIZED POPULATIONS. ", " IN 2019 WE HAVE OFFERED 125  PROGRAMS, ROUGHLY 6600 HOURS OF  PROGRAMMING FOR OVER 2700  PARTICIPANTS. ", " AND THEN AND LIFELONG  RECREATION, 780 PROGRAMS WITH  ROUGHLY 9700 PARTICIPANTS  PARTICIPATING IN OVER 7000  HOURS OF PROGRAMMING FUNDED BY  THE PARK DISTRICT. ", " AND FINALLY, ON THE BUILDING  FOR THE FUTURE CATEGORY, WHICH  INCLUDES DEVELOPING SOME OF THE  LAND BANK SITES REQUIRED  THROUGH PREVIOUS LEVIES  INCLUDES THE MAJOR PROJECTS  CHALLENGE FUND AS WELL AS URBAN  PARKS PARTNERSHIP, OTHERWISE  NOTICED HE IS BE. ", " THE MAJOR PARKS CHALLENGE FUND  COMPLETED A COUPLE OF  FEASIBILITY STUDIES TO SUPPORT  WORK BY SOME OF OUR PARTNERS IN  OUR FACILITIES AND HAVE, WILL  CONTINUE TO WORK WITH THEM, TWO  OF THOSE WERE COMPLETED IN 2019.", " AND OF THE LAND BANK SITES, I  AM HAPPY TO REPORT WE COMPLETED  AND OPENED OUR TWO FIRST NEW  PARKS THAT WERE DONE, ALICE  BALLPARK IN THE GREENWOOD  DISTRICT IN THE URBAN TRIANGLE  PARK IN THE SOUTH LAKE UNION  DISTRICT, BRAND NEW PARKS  BROUGHT INTO THE INVENTORY. ", " OF THOSE LAND BANK SITES, WE  HAVE THREE MORE UNDER  CONSTRUCTION, AND FOR OTHERS IN  DESIGN THAT WILL GO INTO  CONSTRUCTION SOON. ", " &gt;&gt; CAN I ASK YOU A QUICK  QUESTION? ", " JUST GOING BACK TO LAND  ACQUISITION, THE TWO PARCELS WE  ACQUIRED, THE ONE THAT I WAS  REALLY EXCITED ABOUT, THORNTON  CREEK. ", " WHERE ARE WE ON THAT? ", " WE HAVE NOT DONE DEMOLITION OR  ANYTHING YET? ", " &gt;&gt; I DON'T BELIEVE WE HAVE DONE  ANY DEMOLITION. ", " THIS IS IN CONJUNCTION WITH  SPU. ", " WE JUST SIGNED THE EMMA WAY TO  TALK ABOUT WHO IS DOING WHAT  AND ARE MOVING FORWARD. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; AND THE DUWAMISH WATERPARK  IN THE SOUTH PARK AREA. ", " AND THE INITIATIVE ALSO FUNDS  MANY EVENTS AND ACTIVITIES, AND  PARTICULARLY THE CORE OF THIS  WAS THE DOWNTOWN PARK  ACTIVATION PROGRAM IN  PARTNERSHIP WITH THE SEATTLE  DOWNTOWN ASSOCIATION THAT  CONTINUED THEIR ROBUST  PROGRAMMING AT BOTH WEST LAKE  AND OCCIDENTAL AS WELL AS, WE  HAVE CONTINUE TO USE AN  EXPANDED 11 ADDITIONAL PARKS IN  THE CENTRAL AREA. ", " &gt;&gt; OKAY. ", " SO THIS FIRST SLIDE, THIS TABLE  SHOWS FOR THE PARK DISTRICT  OPERATING INITIATIVES, THE  CUMULATIVE VERSUS ACTION WAS  FROM 2015 TO 2018 AS WELL AS  THE 2019 BUDGET TO ACTUALS. ", " THROUGH SEPTEMBER. ", " THE PARK DISTRICT OPERATING  INITIATIVES ARE MOSTLY SPENT  EACH YEAR, AS YOU CAN SEE FROM  THE CUMULATIVE ACTUALS TOTAL. ", " 96% WAS SPENT FROM 2015 TO  2018. ", " SPENDING VARIES AMONG  INITIATIVES BASED ON WHAT THE  INITIATIVE IS FUNDING. ", " FOR EXAMPLE, INITIATIVE THREE- POINT TO, RECREATION  OPPORTUNITIES FOR ALL, OTHER  PROGRAMS FOR PEOPLE, PROVIDES  GRANTS TO COMMUNITY GROUPS TO  PROVIDE CULTURALLY RELEVANT  FREE PROGRAMS TO COMMUNITIES OF  COLOR, AND MORE SPENDING  HAPPENS IN THE FOURTH QUARTER  WHEN THE COMMUNITY GROUPS  RECEIVE THEIR REIMBURSABLE  BASED FUNDING. ", " OTHER FACTORS COULD INCLUDE  VACANCIES FOR POSITIONS FUNDED  THROUGH THE INITIATIVES AND  ALSO WHEN THE TIMING OF BILLS  OCCUR. ", " FOR EXAMPLE, IN INITIATIVE 1.6, ", " UTILITY BUILDINGS, WE RECEIVE  THOSE PILLS TWICE A YEAR. ", " SO IT IS NOT A STRAIGHTFORWARD  SPEND. ", " AND WE FULLY EXPECT TO SPEND  MOST OF THE 2019 OPERATING  INITIATIVES BY THE END OF THIS  YEAR. ", " &gt;&gt; THE NEXT SLIDE SHOWS OUR  PARK DISTRICT FINANCIALS FOR  THE CAPITOL SIDE. ", " WE, SO AGAIN, THERE ARE TWO  PARTS TO THE TABLE. ", " ONE SHOWS THE 2015 TO 2018 THAT  &gt;&gt; GO BACK TO THE PREVIOUS  SLIDE FOR A MOMENT. ", " THANK YOU. ", " ON THE RESTORING THE COMMUNITY  CENTER OPERATIONS. ", " I KNOW THERE WERE PLANS, AND WE  DIED IDENTIFIED SIX. ", " COMMUNITY CENTERS IN OUR 2015  INITIAL BUDGET. ", " CAN YOU GIVE ME JUST A QUICK  CAPSULE OF WHERE THOSE  COMMUNITY CENTERS ARE, THE  OPERATIONS IN TERMS ADJUST THE  SCHEDULE? ", " DID WE MEET THOSE COMMITMENTS? ", " &gt;&gt; YOU MIGHT BE REFERRING ON  THE CAPITOL SIDE. ", " THAT POT OF MONEY THERE WAS  OPERATING DOLLARS THAT WENT TO  RESTORING HOURS AND HIRING  STAFF AND SOME FUNDING FOR  IMPROVEMENTS. ", " &gt;&gt; WILL BE GET TO THAT SLIDE IN  THE FUTURE? ", " &gt;&gt; YES. ", " &gt;&gt; GREAT. ", " THANK YOU. ", " THAT WAS MY MISTAKE. ", " &gt;&gt; SO ON THE CAPITOL SIDE, THIS  TABLE SHOWS BUDGET TO ACTUALS  2015 THROUGH 2018 AS WELL AS  BUDGET TO ACTUALS FOR 2019  THROUGH SEPTEMBER. ", " AND CUMULATIVE SPENDING FOR THE  PARK DISTRICT ON THE CAPITOL  SIDE IS APPROXIMATELY 50%, AND  THIS COMES FROM A TOTAL  ALLOCATION OF $142 MILLION,  WHICH IS COMPRISED OF THIS $140  MILLION IN THE 2015 THROUGH  2018 COLUMN AS WELL AS 28  MILLION THAT WAS INCLUDED IN  THE 2019 ADOPTED. I SHOULD NOTE ", " TOO THAT THE 2019 REVISED  BUDGET COLUMN YOU SEE HERE  INCLUDES BOTH CARRY FORWARD  FROM 2015 THROUGH 2018 AS WELL  AS THE 2019 ADOPTED BUDGET. ", " &gt;&gt; CAN YOU SLOWDOWN? ", " SO WHAT WAS THE TOTAL AMOUNT  LAST MONTH? ", " I LOST TWO. ", " &gt;&gt; OKAY. ", " WHAT I WANTED TO SAY HERE IS  THAT OUR TOTAL BUDGET  ALLOCATION THUS FAR HAS BEEN  ABOUT $142 MILLION, AND THAT IS  COMPRISED OF $140 MILLION THAT  WE HAD IN THE 2015 TO 2018  BUDGET. ", " AND THEN INCLUDED IN THE 2019  REVISED BUDGET WE HAVE 28  MILLION OF 2019. ", " SO THE 114 PLUS THE 28 MILLION  EQUALS 142 MILLION. ", " TO DATE WE HAVE SPENT, AS YOU  CAN SEE FROM THE ACTUALS  COLUMNS, 49 MILLION FROM 2015  TO 2018 AS WELL AS 21 MILLION  FOR 2019. ", " SO THOSE TWO OUT UP TO 70  MILLION. ", " IF YOU TAKE 70 MILLION INTO THE  142, YOU GET ABOUT 50%. ", " &gt;&gt; OKAY. ", " &gt;&gt; SO TO HIGHLIGHT A FEW ITEMS  IN THE SLIDE. ", " THE FIRST ONE I THINK IS ONE OF  INTEREST, THE ONE POINT ONE  MAJOR MAINTENANCE BACKLOG AND  ASSET MANAGEMENT. ", " AND SPENDING HAS BEEN  ACCELERATING ANNUAL LEASE ON  THIS SINCE 2016 WITH A PLAN  SPANNED THIS YEAR OF $22  MILLION, THE HIGHEST OF ALL THE  YEARS. ", " WE ARE ANTICIPATING THAT A  MAJORITY OF THE REMAINING MAJOR  MAINTENANCE INITIATIVE WILL BE  MOSTLY SPENT IN 2020 WITH A  SMALL RESIDUAL REMAINING IN  2021. ", " LARGE PROJECTS WITH ANTICIPATED  COMPLETION IN 2020 INCLUDE  ATHLETIC FIELD RENOVATIONS,  SYNTHETIC TURF, REPLACEMENTS,  POOL RENOVATIONS AND PLAY  RENOVATIONS. ", " ANOTHER INITIATIVE TO HIGHLIGHT  HERE IS ONE POINT TO, COMMUNITY  CENTER REHABILITATION AND  DEVELOPMENT. ", " THIS IS THE ONE I THINK. ", " THIS WAS INITIALLY ON HOLD  WHILE WE COMPLETED THE  COMMUNITY CENTER STRATEGIC  PLAN, WHICH WAS IN SEPTEMBER  2016. ", " STABILIZATION WORK IS UNDERWAY  FOR FIVEOF THE SIX CENTERS,  INCLUDING HIAWATHA, JEFFERSON,  MAGNOLIA, QUEEN AND AND SOUTH  PARK. ", " &gt;&gt; THERE WAS A COMMUNITY CENTER  ASSESSMENT PLAN? ", " &gt;&gt; CORRECT. ", " &gt;&gt; QUICK QUESTION. ", " I KNOW THAT ALL OF THESE  COMMUNITY CENTERS ARE CONCERNED  WE ARE PUTTING BAND-AIDS ON  SOMETHING THAT REALLY NEEDS A  MUCH BIGGER INVESTMENT. ", " WHERE ARE WE IN THAT SENSE OF  MAKING THE MUCH BIGGER  INVESTMENT FOR ALL OF THESE  COMMUNITY CENTERS? ", " INCLUDING THE POSSIBILITY THAT  WE TALKED MANY TIMES ABOUT  BEING ABLE TO RESTORE THE  CENTER, BUT TO BUILD HOUSING ON  TOP OF SOME OF THEM. ", " &gt;&gt; THAT'S A GREAT QUESTION. ", " SO THE ANSWER TO THE QUESTION  IN TERMS OF THE BAND-AID  PRESSURE, YOU ARE EXACTLY  RIGHT, THAT WAS OUR CONCERN AS  WELL. ", " WE DID THE ORIGINAL PLAN, IT  WAS LOOKING AT HOW TO INVEST  ENOUGH SO WE CAN CONTINUE TO  OPERATE. ", " IT IS A LONGER-TERM QUESTION  PALMA BUT THAT WAS WHAT THE  STABILIZATION CONCEPT IS ABOUT. ", " IN TERMS OF LONGER-TERM  INVESTMENT, THAT IS WHAT WE ARE  IN THE MIDDLE OF RIGHT NOW. ", " THE STRATEGIC PLANNING PROCESS  WE JUST FINISHED THAT WE WILL  COME BACK AND SHARE, AND THEN  THAT STRATEGIC PLANNING PROCESS  WILL BE THE FOUNDATION FOR THE  CONVERSATION FOR THE NEXT 6 TO  12 YEARS OF THE PARK DISTRICT  CYCLE. ", " SO A BIG PART OF THAT WORK IS  LOOKING AT ALL THE COMMUNITY  CENTER PORTFOLIO TO GET A SENSE  OF WHERE WE WANT THESE  COMMUNITY CENTERS TO BE FROM A  MINIMUM OPERATIONAL STANDPOINT  AND WHAT, IF ANYTHING, SHOULD  BE EXPANDED. ", " BEYOND THE BAND-AID BUT THOSE  ARE STILL THINGS WE ARE  PLANNING IN THE FINANCIALS THAT  WE DON'T HAVE, BUT I KNOW YOU  KNOW SOME OF THESE BUILDINGS,  THAT NUMBER COULD GET VERY BIG  VERY QUICKLY. ", " SO WE HAVE TO BE VERY  THOUGHTFUL ABOUT HOW TO  STRATEGIZE WHERE THE CENTERS  GO. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; OKAY. ", " ANOTHER WAY TO HIGHLIGHT IS  INITIATIVE FOR.FOR, WHICH IS ", " THE 14 NEW PARKS ATLANTA BANK  SITES. ", " IN THIS CATEGORY, IN THIS  INITIATIVE SPENDING REFLECTS  THE WERE CURRENTLY HAPPENING  WITH THE 14 LAND BANK SITES. ", " THE CURRENT PLAN IS THAT 10 OF  THE 14 WILL BE COMPLETE BY THE  END OF 2020 AND FOUR WILL BE IN  CONSTRUCTION. ", " AS WAS PREVIOUSLY MENTIONED,  THE FIRST COMPLETED PROJECT,  ALICE PAUL, OPENED IN JUNE OF  THIS YEAR AND URBAN TRIANGLE  WAS COMPLETED. ", " THE LAST ONE WE WANT TO  HIGHLIGHT FOR YOU IS SMITH COVE  PARK DEVELOPMENT. ", " THIS ONE IS CURRENTLY IN EARLY  DESIGN STAGES, WHICH IS  REFLECTED IN THE SPENDING, THE  LOW SPENDING. ", " CONSTRUCTION DOCUMENTATION IS  NEAR 100%, AND THE TEAM IS  WAITING FOR FINAL PERMITS. ", " THE PROJECT WILL BE BID IN THE  FALL OR WINTER, FALL OF 19 OR  WINTER 2020 AND CONSTRUCTION  WILL BEGIN IN EARLY 2020 IN THE  SECOND PHASE, THE EASTERN  PORTION, WILL BE CONSIDERED AS  PART OF THE NEXT CYCLE  FINANCIAL PLAN. ", " &gt;&gt; COUNCILMEMBER BACK SHOPPING  &gt;&gt; I KNOW DON HARPER LIKE ME  HAS BEEN WORKING ON SMITH COVE  PARK FOR WHAT IT FEELS LIKE  MUCH OF OUR LIFETIME NOW. ", " BUT IT FEELS TO ME THAT THE  WHOLE PROJECT IS WAY MORE  EXPENSIVE THAN WHAT WE HAD  INITIALLY THOUGHT. ", " SO THE WEST SIDE WE HAD THE  SOCCER FIELDS AND THEN WE HAD  TO DO THE CONSTRUCTION FOR THE  OVERFLOW, OR THE PIPES THAT  WERE COMING DOWN OFF THE  HILLSIDE. ", " AND THEN THERE WAS SOMETHING  ELSE THAT WENT ON, AND THEN WE  WERE DIGGING IT UP AGAIN. ", " DO WE HAVE A SCHEDULE NOW FOR  WHEN THAT WESTSIDE WILL BE  COMPLETED? ", " AND ALSO, I KNOW THE  NEIGHBORHOOD HAS REALLY BEEN  INTERESTED IN THE EASTSIDE  BECAUSE THAT TOUCHES WATER ON  THE EASTSIDE, BUT ALSO  POTENTIALLY RIGHT DOWN TO THE  WATER ON THE SOUTH SIDE OF THE  PARK. ", " WHAT IS THE SCHEDULE ABOUT? ", " &gt;&gt; THE WEST SIDE, WE EXPECT TO  GO TO CONSTRUCTION EARLY NEXT  YEAR, 2020. ", " I DON'T HAVE A NOTE ON HOW LONG  THE CONSTRUCTION IS ANTICIPATED  TO TAKE, BUT WE SHOULD START  CONSTRUCTION. ", " THE SECOND PHASE, AS YOU SAID,  IS PROBABLY JUST AS EXPENSIVE  AS THE FIRST PHASE, BUT THAT IS  NOT BEEN COSTED OUT YET AND THE  ANTICIPATION IS TO LOOK AT IT  FOR THE SECOND ROUND. ", " &gt;&gt; WE HAVE HAD MANY DESIGNS AND  PEOPLE IN MAGNOLIA AND QUEEN  ANNE IN PARTICULAR HAVE BEEN  LOOKING AT MAKING THAT A PLACE  WHERE PEOPLE CAN LAUNCH THEIR  KAYAKS AND ALSO DO, I THINK  THERE WAS EVEN SOME VOLLEYBALL  COURTS THAT WERE GOING TO BE  INCLUDED. ", " BUT PRIMARILY IT WAS NOT GOING  TO BE IS ACTIVELY SCHEDULED AS  WHAT WAS HAPPENING ON THE WEST  SIDE. ", " I HEAR FROM COLLEAGUES,  PARTICULARLY MAGNOLIA, WE HAVE  BEEN WORKING ON THIS THING FOR  15 YEARS, HOW COME IT IS NOT  MOVING FORWARD? ", " SO I HOPE IN MY ABSENCE THAT  YOU WILL CONTINUE TO HAVE PEOPLE THAT KEEP THAT ONE MOVING  FORWARD. ", " &gt;&gt; ABSOLUTELY. ", " I THINK IT DOES PRESENT A  UNIQUE OPPORTUNITY TO HAVE  WATER ACCESS AGAIN. ", " I THINK THAT IS THE EXCITING  PART OF IT. ", " BUT AS YOU SAID, IT IS NOT YET  FUNDED, AND THERE IS A LOT OF  EXCITING CONCEPTUAL DESIGNS PUT  TOGETHER, BUT THE HOPE IS TO  CONTINUE. ", " &gt;&gt; WILL WE PUT MORE FUNDING IN,  OR IS THAT THE PLAN FOR THE  PARK DISTRICT GOING FORWARD SO  WE CAN COMPLETE IT? ", " &gt;&gt; IT IS ON OUR LIST OF THE  THINGS THAT, OF THE VERY LONG  LIST OF THINGS IN TERMS OF  POTENTIALLY BEING FUNDED IN THE  SECOND OR THIRD ROUND OF THE  PARK DISTRICT. ", " IS DEFINITELY THERE. ", " &gt;&gt; SOMEWHERE. ", " &gt;&gt; JUST ON THE 2019 BUDGET  VERSUS ACTUALS, DID THE  TIMELINE SLIP FROM WHEN WE SET  THE BUDGET LAST YEAR  SIGNIFICANTLY? ", " &gt;&gt; IN TERMS OF THE SPEND RATE? ", " &gt;&gt; YEAH. ", " SPENDING ALMOST 5.$5 MILLION ", " AND WE ARE AT $60 MILLION TO  DATE. ", " &gt;&gt; I'M SORRY, YOU'RE TALKING  ABOUT SMITH COVE. ", " &gt;&gt; THAT'S RIGHT. ", " &gt;&gt; I THINK THE DESIGN AND THE  BIDDING AND ALL OF THAT TOOK A  LITTLE LONGER THAN ANTICIPATED. ", " THOSE COSTS ONLY REFLECT THE  EARLY DESIGN. ", " I'M SURE THEY'RE STILL BILLS  DUE TO US FOR SOME OF THE FINAL  DESIGN BEFORE WE GO TO BED. ", " &gt;&gt; WHEN I LOOK ACROSS THE  BOARD, ACTUALS THROUGH  SEPTEMBER VERSUS BUDGET. ", " WE'RE AT 22%, SO IS THAT THEME  JUST CONSISTENT ACROSS THEM? ", " &gt;&gt; THERE ARE DIFFERENT REASONS  FOR EACH OF THESE THINGS, BUT  HOLISTICALLY, IT IS BROUGHT  THEMED THAT I AM REALLY  CONCERNED ABOUT LOOKING AT IT  FROM THE STANDPOINT OF JUST  BEING ABLE TO GET THE  INFORMATION. ", " FOR EXAMPLE, THIS TABLE IS  CONFUSING IN MANY WAYS. ", " NOT BECAUSE, ONLY BECAUSE IT IS  HARD TO PUT A LOT OF  INFORMATION. ", " FOR EXAMPLE, FOR 2019 THE $93  MILLION IN THE THIRD TO LAST  COLUMN INCLUDES CARRYOVER FUNDS  FROM 2015 THROUGH 2018 PLUS $28  MILLION NEW FOR 2019. ", " THOSE CARRYOVERS ARE HARDER  BECAUSE THERE ARE PROJECTS IN  VARIOUS STAGES. ", " SUMMER STILL STARTING EARLY,  SOME ALMOST DONE. ", " IT IS HARD TO TRACK THEM UNLESS  WE PUT TOGETHER A GIGANTIC  SPREADSHEET FOR YOU. ", " PLUS THE --  &gt;&gt; 70. ", " &gt;&gt; THE TOTAL WE SPENT IS ABOUT  50% OF EVERYTHING WE HAVE HAD  ALLOCATED. ", " AGAIN, EVERY PROJECT IS  DIFFERENT, SOME ARE COMPLETELY  DONE IN SUMMER DELAYED FOR  DIFFERENT REASONS. ", " THAT IS A NUMBER I AM WATCHING  VERY CLOSELY TO MAKE SURE WE  CONTINUE TO STAY ON TOP OF IT  AND DO BETTER WITH REPORTING,  BUT ALSO DO BETTER WITH OUR  PROJECT MANAGEMENT. ", " SO A COUPLE OF THINGS WE HAVE  DONE ALREADY IS WE HAVE MADE  SIGNIFICANT CHANGES WITH OUR  PLANNING AND DEVELOPMENT  DIVISION THAT OVERSEES ALL  THESE PROJECTS TO JUST DO A  BETTER JOB OF THAT. ", " WE ARE ADDING A NEW PROCESS FOR  EXAMPLE, A STAGE GATING PROCESS  THAT EACH STAGE WE HAVE BETTER  INFORMATION BECAUSE OFTEN WHAT  WILL HAPPEN, BUT THE PROJECT  WILL GO THROUGH, AND WHEN IT IS  ABOUT TO GO TO BED, WE REALIZE  THE ESTIMATES ARE HIGHER THAN  THE BUDGET SO THEN THE KIDS PUT  ON HOLD AND THEN WE HAVE TO  FIGURE OUT HOW TO FUND IT. ", " WE WANT TO SET IT UP SO THAT  EACH STAGE WE HAVE THOSE  CONVERSATIONS EARLY AND HAVE A  BETTER SENSE OF WHAT IS  HAPPENING. ", " AND FRANKLY WE JUST ADDED MORE  CAPACITY. ", " THIS IS A GROUP THAT HAS BEEN  DELIVERING ROUGHLY $70 MILLION  WORTH OF PROJECTS EVERY YEAR. ", " AT LEAST ACTIVE PROJECTS. ", " THE LAST COUPLE OF MONTHS WE  HAVE ADDED MORE STAFF THERE. ", " FINALLY, WE ARE GETTING AN  OUTSIDE CONSULTANT, PAR  CONSULTING, COMING IN AND  DIGGING INTO ALL OF THESE AND  GIVING RECOMMENDATIONS, SOME OF  WHICH WERE ALREADY STARTING TO  IMPLEMENT. ", " BUT OUR HOPE IS THAT AS WE  CLOSE OUT THIS FIRST SIX YEAR  CYCLE, WE ARE DOING BETTER NOW  WAS SPENDING, BUT REALLY HAVE A  SOLID PLAN TO MAKE SURE WE ARE  BETTER AT MANAGING. ", " AND PRESENTING THE INFORMATION  IN A WAY THAT IS EASIER TO  FOLLOW FOR FOLKS TO UNDERSTAND. ", " &gt;&gt; I WILL JUST SAY THAT IT  SEEMS LIKE A SIMILAR PARALLEL  TO SOME OF THE CHALLENGES  D.O.T. ", " HAS HAD. ITSELF LIKE SOME OF ", " THE RESPONSES YOU'RE MAKING ARE  SIMILAR TO THAT, WHICH IS  GREAT. ", " OBVIOUSLY, AS WE MOVE TOWARDS  THIS TIME NEXT YEAR WHEN WE  WILL BE UPDATING, I THINK IT IS  GOING TO BE REALLY HELPFUL TO  HAVE AS MUCH CLARITY ABOUT  WHERE WE ARE GOING ON THAT. ", " YOU KNOW, WHEN A PROJECT TAKES  FOUR YEARS INSTEAD OF TWO  YEARS, THERE IS PROBABLY AT A  COST, BUT THE BIGGEST THING FOR  MY PERSPECTIVE IS THAT THE  PROJECT IS NOT AVAILABLE TO BE  USED FOR A COUPLE OF YEARS. ", " IF THE REALITY IS THAT WE ARE  JUST TOO AMBITIOUS IN THE  TIMELINES AND THE PROJECTS ARE  FOR YOUR PROJECTS, AND WE JUST  MISSED THAT WHEN WE FIRST PUT  IT IN, THEN THAT IS FAIR. ", " LET'S USE THAT WHEN WE THINK  ABOUT HOW MUCH CAPACITY WE HAVE  NEXT YEAR WITH THE CASH FLOWS  COMING IN, AND LET'S MATCH THE  STAFF TO THAT AS SOON AS WE CAN  TOO. ", " &gt;&gt; ABSOLUTELY. ", " BECAUSE NOT EVERY PROJECT TAKES  THE SAME AMOUNT OF TIME. ", " WE NEED TO BE MUCH MORE  SPECIFIC ABOUT THESE INDIVIDUAL  POJECTS. ", " WHICH WILL HAVE INPUT IN THE  WAY WE BUDGET. ", " BECAUSE RIGHT NOW THE WAY WE  BUDGET, WE BUDGET FOR EVERY  PROJECT HAVING THESE THREE  PHASES IS A PHASE 1 IS THIS  YOUR, PHASE 2 IS THIS YEAR, BUT  IF ANYTHING CHANGES BECAUSE THE  SCOPE IS DIFFERENT, THEN THE  BUDGETING IS OUT OF WHACK. ", " SO WE WANT TO GET BETTER AT  EACH YEAR UPDATING THE BUDGET  TO GET A BETTER SENSE OF WHAT  IS HAPPENING. ", " &gt;&gt; I THINK WE NEED TO SELL THEM  AS THE PARKS DISTRICT, BUT THE  REPORTING, I KNOW D.O.T. ", " HAS STRUGGLED WITH HOW TO  ACCURATELY REPORT THE CARRYOVER  MONEY FROM LAST YEAR TO THIS  YEAR. ", " ARE WE ON TARGET OR NOT? ", " DEPENDS ON HOW YOU LOOK AT THE  NUMBER. ", " SO NOT THE MOST IMPORTANT THING  TO WORK ON, BUT SOME WAY TO  REPORT ON THAT SO WE CAN HAVE  WAYS TO ESSENTIALLY HOLD YOU  ALL ACCOUNTABLE TO SAY I KNOW  WE STARTED OFF SLOW, BUT ARE WE  ON PACE NOW? ", " SOME WAY TO DELIVER THAT  INFORMATION WOULD BE HELPFUL. ", " &gt;&gt; NOT KEEPING THIS TO DEATH,  THE OTHER COMPETITION IN  ADDITION TO TIMING IS THE  DIFFERENT FUNDING SOURCES. ", " THAT IS WHERE THE TRANSPARENCY  PIECE GETS REALLY IMPORTANT AND  COMPLICATED. ", " I DO YOU THINK IT IS REALLY  IMPORTANT. ", " &gt;&gt; WILL BE GO INTO THE NEXT  PLAN, WE MAY WANT TO THINK  ABOUT BUDGETING BECAUSE REALLY  WHAT WE HAVE ON THE CAPITOL  SIDE IS THE APPROPRIATION. ", " IS NOT THE SPENDING PLAN, AND  JUST EXACTLY WHAT JESUS IS  SAYING, SOME ARE MULTIPLE YEARS . THEY'RE NOT GOING TO ACTUALLY ", " SPEND A LOT OF THEIR BUDGET  UNTIL THEY GET TO CONSTRUCTION. ", " BUT THAT IS NOT WHAT YOU SEE IN  FRONT OF YOU. ", " YOU SEE THE APPROPRIATION. ", " THAT IS MUCH MORE TRUE FOR THE  OPERATING WHERE YOU GET THE  APPROPRIATION IN THAT ONE YEAR  AND SPEND ALMOST 99% OF THE  MONEY GETS SPENT IN THAT ONE  YEAR. ", " &gt;&gt; YEAH, THAT IS THE REALITY,  THEN OBVIOUSLY ALL THE  QUESTIONS ARE MOVED. ", " SEEMS LIKE THERE IS A MIX OF  THING. ", " &gt;&gt; I THINK THAT IS ALL WE HAD. ", " &gt;&gt; ANYTHING ELSE? ", " WORDS OF WISDOM? ", " &gt;&gt; NO. ", " THANK YOU. ", " &gt;&gt; I AM HAPPY TO ANSWER. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; CHAIR, I HAVE A QUESTION. ", " WE HAD A PUBLIC HEARING ON  THREE RESOLUTIONS RELATED TO  THE REVENUE SOURCES FOR THE  2020 OPERATIONS BUDGET AND THE  POTENTIAL TAX LEVY INCREASE IN  2020. ", " ARE WE, ARE THESE PART OF  BUDGET LEGISLATION WE'RE GOING  TO VOTE ON? ", " &gt;&gt; WE WERE ACTUALLY VOTED THEM  NEXT ON MONDAY AFTER THE VOTE  ON THE ENTIRE BUDGET, THEN WE  GO INTO THE PARK DISTRICT  MEETING AND ADOPT ALL THE  RESOLUTIONS AND THEN ADOPT A  PARKS DISTRICT PORTION OF  FUNDING AND BUDGETS. ", " &gt;&gt; AND SO, I AM JUST STRUGGLING  A LITTLE BIT WITH THE FACT THAT  IT APPEARS WE'RE MAKING SOME  COMMITMENTS FOR 2020, BOTH ON  THE OPERATING AND CAPITOL SIDE. ", " AND WE DID NOT HEAR VERY MUCH  FROM THE PUBLIC TODAY ON THAT. ", " COULD YOU MAYBE TALK A LITTLE  BIT MORE ABOUT THE PUBLIC  PROCESS THAT PARKS HAS DONE  THAT IS LED TO THESE  RECOMMENDATIONS AND THESE THREE  RESOLUTIONS? ", " &gt;&gt; WE HAVE NOT HAD A PUBLIC  HEARING YET. ", " I THINK THERE ARE SOME PEOPLE  SIGNED UP. ", " &gt;&gt; SORRY. ", " &gt;&gt; BUT WE ARE GOING TO HAVE IT  TODAY. ", " &gt;&gt; AND THESE FINE FOLKS WILL BE  TALKING TO US. ", " I'M JUST WONDERING. ", " HAS IT BEEN OTHER PUBLIC  PROCESS? ", " &gt;&gt; IN TERMS OF, AND I  APOLOGIZE, I'M NOT SURE. ", " YOU'RE TALKING ABOUT THE  RESOLUTIONS, THE LEVY RATE AS  PART OF THE BROADER? GOT IT. ", " I THINK IN TERMS OF OUR  ENGAGEMENT, SO CERTAINLY  THERE'LL BE THIS HEARING. ", " WE HAVE REGULAR PARK DISTRICT  AND OVERSIGHT COMMITTEE  MEETINGS AND PARK BOARD  MEETINGS AND TALK A LOT ABOUT  THESE ISSUES. ", " AND THEN CERTAINLY THROUGH OUR  ENGAGEMENT PROCESS THAT WE JUST  COMPLETED, WASN'T SPECIFIC TO  2020, BUT REALLY ABOUT WHAT ARE  THE PRIORITIES AND THE THINGS  THE COMMUNITY CARES ABOUT. ", " THOSE ARE CERTAINLY INFORMING  WHAT WE ARE GOING TO DO FOR  2020 AND BEYOND. ", " BUT IN TERMS OF THE CURRENT  BUDGET, WE DIDN'T DO ANYTHING  SIGNIFICANT OR ANYTHING  SPECIFIC. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; ANYONE ELSE? ", " OKAY. ", " ARE WE DONE? ", " OKAY. ", " THANK YOU. ", " THAT WILL AND THE PRESENTATION. ", " SO WITH THAT, COUNCILMEMBER  HERBOLD, YOU ARE CORRECT, WERE  GOING TO GO TO PUBLIC HEARING. ", " IN REGARDS TO, WE PUT OUT A  NOTICE FOR TODAY STARTING AT  2:30 PM. ", " SO WE WILL NOW OPEN THE PUBLIC  HEARING TO ACCEPT COMMENTS ON  THE BUDGET OF POTENTIAL  PROPERTY TAX LEVY INCREASE FOR  2019. ", " HOW MANY PEOPLE ARE SIGNED UP? ", " &gt;&gt; WE HAVE TWO PEOPLE SIGNED UP  FOR THE HEARING. ", " &gt;&gt; YOU CAN STILL SIGN UP. ", " SO WE HAVE THREE PEOPLE NOW. ", " FOUR. ", " YOU WANT TO CALL THE FIRST TWO  FOR ME? ", " &gt;&gt; THE FIRST SPEAKERS ARE TIM  MOSER AND PAT GRIFFITH. ", " &gt;&gt; MY NAME IS TIM MOSER, LAKE  CITY NEIGHBORHOOD ALLIANCE, 25  ORGANIZATIONS. ", " I'M HERE AT YOUR PUBLIC HEARING  TO SUPPORT THE PARK DISTRICT  OVERSIGHT COMMITTEE  RECOMMENDATION PROVIDED AT YOUR  JUNE 24 MEETING TO REPAYING THE  CURRENT 2019 PARK DISTRICT  PROPERTY TAX OF $.22 THROUGH ", " 2020. ", " I AM A LITTLE DISAPPOINTED  GIVEN YOUR COMMENT,  COUNCILWOMAN HERBOLD, ABOUT TO  SEE RESOLUTION 32 AS THAT  PEGGED AT $.21. ", " SO I GUESS MY QUESTION IS,  WHERE IS THE CONSIDERATION OF  YOUR OVERSIGHT COMMITTEE ON  THAT ISSUE? ", " AFTER REVIEWING RESOLUTION 30,  WHICH INCLUDES THE PARK  DISTRICT BUDGET, I HAVE A  NUMBER OF QUESTIONS RELATED TO  SEVERAL LINE ITEMS, SOME  QUESTIONS HAVE BEEN ANSWERED. ", " THE FIRST ONE IS TO RESTORE  COMMUNITY CENTER OPS AS ALL THE  $1.4 MILLION THAT WAS ", " ORIGINALLY CUT FROM THIS LINE  ITEM THEN RESTORED SINCE YOUR  2018 BUDGET ACTION ONLY  RESTORED $850,000 OF THOSE  FUNDS. ", " SO THAT IS THE QUESTION. ", " TWO I AM AWARE THAT THE  COMMUNITY LINE ITEM WAS  INCREASED SUBSTANTIALLY IN  2019. ", " IT WAS AT ONE POINT I MILLION  DOLLARS INCREASE TO FUND THE  COMMUNITY CENTER POSITIONS AT  TRENT ARC WAS NO LONGER WILLING  TO FUND. ", " SECOND AREA, COMMUNITY CENTER  WE HAVE DEVELOPMENT. ", " GIVEN THE SUBSTANTIAL REDUCTION  IN LIGHT ITEMS STARTING IN 2019  AND 2020 OF $320,000, HOW MUCH  OF THAT BUDGET WAS ACTUALLY  SPENT? ", " I THINK THE ANSWER TO THAT  QUESTION WAS $2.5 MILLION. ", " DID ANY OF THE SIX IDENTIFIED  COMMUNITY CENTERS GET PLAITED? ", " I DID NOT HEAR THE ANY OF THEM  DID. ", " IT SOUNDS LIKE THEY ARE STILL  ALL IN PROGRESS. ", " AND WHAT KIND OF FINANCIAL  OBLIGATION AGAINST THE NEXT SIX  YEAR FUNDING CYCLE WILL BE  CREATED TO FINISH THOSE SIX  COMMUNITY CENTERS THAT WERE NOT  COMPLETED? ", " I WOULD LIKE TO REITERATE A  RECOMMENDATION I MADE YOU IN  THE PAST SEVERAL YEARS, AND  THAT IS TO REVISE THE PARK  DISTRICT RESOLUTION TO ALLOW  FOR MIDYEAR CORRECTIONS THAT  WOULD ALLOW FOR INCREASES AND  SPENDING PLAN IF NEEDED. ", " THIS POSSIBILITY IS NEEDED TO  ALLOW CHANGES TO THE SPENDING  PLAN TO REFLECT MAJOR CHANGES  THAT OCCUR THAT ARE NOT  ANTICIPATED. ", " IN THE LAST SIX YEARS WE HAVE  SEEN SOME HUGE CHANGES,  ESPECIALLY IN THE GROWTH OF THE  CITY. ", " SO I WANT TO THANK THE CITY  COUNCIL FOR CONSIDERATION OF  THESE RECOMMENDATIONS AND  QUESTIONS AS PART OF YOUR 2020  PARK DISTRICT DELIBERATIONS. ", " THANK YOU. ", " &gt;&gt; WE SHOULD ALSO NOTE THAT WE  MET WITH THE PARK DISTRICT  OVERSIGHT COMMITTEE, MISS  McCAFFREY AND FOLKS, AND ALSO  RECEIVED A LETTER FROM THEM  OUTLINING THE ISSUES THAT YOU  HAVE BROUGHT UP. ", " I JUST WANT YOU TO KNOW WE HAVE  THAT. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; THANK YOU. ", " &gt;&gt; MY NAME IS PAT GRIFFITH. ", " MY ORIGINAL COMMENTS AND THE  REASON I CAME WERE MADE BY MR. ", " HARRIS. ", " AND MR. HARPER. ", " BUT MY QUESTION IS, WE HAVEN'T  RECEIVED ANY INFORMATION ON A  TAX INCREASE. ", " AND YOU INTEND TO VOTE ON IT  NEXT WEEK? ", " THAT DOES NOT SEEM QUITE KOSHER.", " AND I AM WONDERING WHY AN  INCREASE IS NECESSARY IF WE  HAVE SUCH AN UNDER SPEND? ", " THANK YOU. ", " &gt;&gt; CAROL BURTON. ", " I WHERE A NUMBER OF HATS. ", " I AM A MEMBER OF THE FRIENDS OF  SMITH COVE PARK THAT OF THE  WORKING I THINK HALF MY  LIFETIME ON SMITH COVE. ", " YOU HAVE BEEN THERE TOO. ", " AND WE REALLY LIKE TO SEE IT  DONE. ", " IT IS BEEN PUT OFF AND PUT OFF  AND PEOPLE ARE VERY  DISAPPOINTED. ", " VERY DISAPPOINTED THAT YOU  CHANGED THE WHOLE COMMUNITY  DEVELOPMENT PLAN BECAUSE YOU  HAVE THIS HIGH-POWERED  INTERNATIONAL COMPANY, G GN,  THAT HAVE NEVER DONE PUBLIC  MEETINGS AND STUFF LIKE THAT. ", " I ALSO WANT TO ECHO. ", " I AM WITH GREEN SEATTLE  PARTNERSHIP TOO, I WAS ONE OF  THE ORIGINAL FOUR STEWARDS. ", " I JUST RECENTLY FOUND OUT THAT  GREEN SEATTLE PARTNERSHIP  BUDGET WAS CUT IN THIS LAST  YEAR. ", " THAT WAS KEPT PRETTY QUIET. ", " WE DO A LOT OF WORK. ", " WITHOUT ALL THE VOLUNTEER  HOURS, YOUR PARKS, YOUR FOREST  AND PARKS, WOULD BE IN REALLY  BAD SHAPE. ", " THIRD THING I WOULD LIKE TO SAY  IS ECHO WITH PAT SAID. ", " THE REASON WE DON'T HAVE  ANYBODY HERE IS BECAUSE NOBODY  KNOWS ABOUT IT. ", " I MEAN, YOU GET THE NOTICE, BUT  THERE WERE NO ATTACHING  DOCUMENTS TO THIS AGENDA. ", " THERE WAS FINALLY A LINK PUT ON  THE PARK DISTRICT PAGE, AND  THEN YOU HAD TO GO THROUGH FIVE  OR SIX PAGES TO FIND SOME  ACTUAL NUMBERS. ", " WHY COULDN'T YOU PUT A LINK ON  THE AGENDA, WHICH IS TYPICAL? ", " I HAVE NEVER SEEN A COUNCIL A  GENTLE AGENDA WITHOUT A LINK TO  SUPPORTING DOCUMENTS. ", " AND PEOPLE ARE SAYING, WHAT IS  HAPPENING? ", " IT IS LIKE, I DON'T KNOW. ", " IT DOESN'T SAY. ", " THEY'RE GOING TO VOTE NEXT WEEK  ON A BUDGET, BUT THEY WILL NOT  TELL US WHAT THE BUDGET IS. ", " SO YOU NEED TO THINK ABOUT THAT  IF YOU WANT TO INCLUDE THE  PUBLIC. ", " I KNOW YOU CAN DO THE TAX  INCREASE WITHOUT A VOTE, BUT  PEOPLE AT LEAST NEED TO KNOW. ", " TIM SAYING THE $.21 IS THE ", " FIRST TIME I HAVE HEARD. ", " I KNOW HE FOLLOWS IT MORE THAN  I DO, BUT I FOLLOW A LOT OF  YOUR STUFF. ", " SO THINK ABOUT THAT. ", " IF YOU WANT THE COMMUNITY, WE  DON'T ALL HAVE TIME TO GO TO  THE OVERSIGHT COMMITTEE OR THE  PARKS COMMISSIONERS AND THAT  KIND OF THING. ", " &gt;&gt; LET ME CLEAR SOMETHING UP. ", " WE HAVE A LITTLE BIT OF  CONFUSION ABOUT WHEN WE POSTED  THE NOTICE. ", " &gt;&gt; THE ATTACHMENTS AND  SUPPORTING DOCUMENTS, MY  UNDERSTANDING IS THAT THEY WERE  ALL HERE. ", " AND THE TAXES. ", " &gt;&gt; NOT ON MY PHONE WITH MY  EMAIL. ", " &gt;&gt; I DON'T WANT TO GET IN AN  ARGUMENT. ", " I WILL MEET WITH YOU AFTERWARDS  IF YOU WOULD LIKE. ", " &gt;&gt; THEY SHOULD'VE BEEN LIVE ON  FRIDAY. ", " I THINK WE GOT ALL THE  MATERIALS TO THE CLERKS BY  FRIDAY. ", " SO THEY SHOULD BE ABLE TO FIND  THEM BY GOING TO THE COUNCIL  WEBPAGE THAT TAKES INTO THE  PARK DISTRICT BECAUSE WE TRIED  TO DO A COMBINED WEBSITE. ", " THEY SHOULD'VE HAD ALL THE  LINKS FOR ALL THE DOCUMENTS. ", " &gt;&gt; TODAY IS MONDAY. ", " &gt;&gt; WHAT WE WILL DO IS, WE'VE  ANSWERED THAT, AND I WILL  FOLLOW-UP WITH YOU IN A MINUTE  CAROL. ", " WHO IS NEXT? ", " &gt;&gt; SUSAN KATHY -- CASEY. ", " &gt;&gt; BEFORE I START MY REMARKS, I  WANT TO SAY IT IS VERY  DIFFICULT FOR THOSE IN THE  AUDIENCE TO UNDERSTAND WHAT YOU  ARE SAYING. ", " IF YOU TURN AWAY FROM YOUR  MICROPHONE, WE CAN'T HEAR YOU. ", " SO WE'RE STRUGGLING TO HEAR  WHAT YOU'RE SAYING. ", " MANY OF THE POINTS I WAS GOING  TO MAKE OF ALREADY BEEN MADE BY  CAROL AND DON AND SO ON. ", " BUT I AM VERY CONCERNED THAT WE  HAVE NOT REALLY HAD EASY ACCESS  TO THE 2020 PROPOSED BUDGET. ", " I'M ALSO CONCERNED THAT YOU  HAVE ONLY MET, YOU ARE ONLY  MEETING TWICE A YEAR AS A BOARD  OF COMMISSIONERS TO OVERSEE  PARKS WORK. ", " I THINK THAT IS -- THE OTHER  THING, BECAUSE I DON'T HAVE A  COPY, AND I WAS ABLE TO STUDY  THE BUDGET, IS THAT I AM VERY  CONCERNED ABOUT TWO THINGS. ", " THE LACK OF APPARENT INTEREST  IN REALLY HAVING NEIGHBORHOOD  PARKS. ", " MY DAUGHTER LIVES IN MONTRCAL  AND IT IS A DANCE -- DENSE  CITY, AND THEY HAVE  NEIGHBORHOOD PARKS FILLED WITH  PEOPLE USING THEM. ", " EVERY FOUR OR FIVE BLOCKS. ", " IT'S AMAZING. ", " WE NEED MORE OF THAT HERE. ", " THE OTHER THING IS, IT SEEMS TO  TAKE SO LONG TO DO THINGS, AND  WE ARE ALWAYS CONSTANTLY  STUDYING AND SOMEONE. ", " LET'S BE MORE REALISTIC ABOUT  WHAT IS BEING DONE AND MAYBE  PERHAPS THE COUNCIL OR THE NEW  COUNCIL SHOULD LOOK AT MORE  PERFORMANCE OF THE AUDITS. ", " THANK YOU. ", " &gt;&gt; ALL RIGHT. ", " &gt;&gt; MR. HINES. ", " STATE YOUR NAME AND WHAT ITEM  YOU'RE SPEAKING TO. ", " &gt;&gt; DAVID HINES ABOUT THE PARK. ", " I FINALLY FIND IT HIGHLY  SUSPECT THAT MOTHER NATURE SEE  NEED SO MUCH MONEY TO PRESERVE  PARKS AND CREATE PARKS WITHOUT  CONCRETE. ", " OR FOR LIKE EMPLOYEES TO MOVE  INTO A BUILDING WHILE PARKS AND  REC HAS THIS HUGE TRASH TRUCK  USED TO THROW STUFF AWAY WITH  THE COPS YELLING AT THE  HOMELESS DO YOU WANT SERVICE. ", " WHY DOESN'T THE PARKS AND REC  TRASH TRUCK GET USED TO PICK UP  ALL THE GOVERNMENT AND  NONGOVERNMENT PARTNERS TO TRY  TO SOLVE THE HOMELESS CRISIS  TRASH, TINY HOME VILLAGES AND  OTHER HOMELESS NONPROFITS,  GETTING SHAKEN DOWN BY WALL  STREET OWED TRASH AND PORTA  POTTY SERVICE. ", " NEEDS TO BE INVESTIGATED  BECAUSE WE NEED THE SAME  BATHROOM, SHOWER, LAUNDRY AS  THE MARINA THAT THE GOVERNMENT  BUILT FOR A BUNCH OF DRAWS A  WANNABE YACHT FOLKS WHO COME  INTO THIS COUNTRY WHENEVER THEY  FEEL LIKE IT. ", " AND THEY GET THE MOST TOP SHELF  LAUNDRY SHOWER AND YOU KNOW,  LIKE, THE HYGIENE NEEDS. AND ", " THE GOVERNMENT BUILT THE WHOLE  THING FOR THEM. ", " AND WE DON'T HAVE THAT FOR THE  HOMELESS, BUT YOU'RE USING THE  PARKS AND REC BUDGET TO CONDUCT  A WAR ON THE HOMELESS WILL NOT  EVEN HAVING THE PROPER, LIKE  SCOTT MOREAU, WITH THE COPS  THING I HAVE A VAN TAKING YOU  TO THE HOMELESS ENCAMPMENT NOW  . HE IS NOWHERE TO EVER BE ", " FOUND. ", " HE SENDS IN HIS LITTLE MINIONS  THAT PAY. ", " BUT YOU CANNOT USE THE PARKS  AND REC, WHICH IS LIKE THE MOST  EXPENSIVE, TO FINANCE MARTIN  SELIG AND ALL THE SHADY  BUILDINGS AND ALL THIS PEOPLE  DON'T GET THEIR HANDS DIRTY  BUTTER REALLY DIRTY IN THE  GOVERNMENT WHO ARE RUNNING THE  PARKS AND REC WERE ALLOWING IT  TO BE USED TO CONDUCT A WAR. ", " AND I DARESAY IT IS MOSTLY THE  GATE PEOPLE IN THE GOVERNMENT  CONDUCTING A WAR ON INNOCENT  POOR PEOPLE AND HAVING A GOOD  OLD TIME WITH JUDGING PEOPLE  HARSHLY. ", " ACTED LIKE THEY COULD FINALLY  FIND SOMEBODY THEY CAN KICK  THEM. ", " AND THE COPS ARE ALLOWING A  WHOLE BUNCH OF PREDATORY  LOWLIFE SATURATING DRUG PUSHERS  WERE DESTROYING PEOPLES LIVES. ", " AND YOU ARE USING THESE PEOPLE  AS WRAPAROUND WERE PROFITABLE  SERVICES WHILE INNOCENT ARE  STILL BEING FORSAKEN BECAUSE  YOU GUYS HAVE NUMBER TO GO  EXCEPT THE JAIL. ", " &gt;&gt; THANK YOU. ", " OKAY. ", " TRYING TO SEE IF WE CAN SPEAK  TO HER FRIENDS. ", " I THINK PEOPLE ARE GETTING  CONFUSED THE PARKS WAS DOING A  PRESENTATION WHICH IS SEPARATE  THAN THE METROPOLITAN PARK  DISTRICT AND WHAT WE ARE GOING  TO VOTE ON NEXT WEEK. ", " AND WHEN WE ARE REQUIRED TO BE,  WHICH IS TWICE A YEAR. ", " IS THAT CORRECT? ", " THAT IS WHAT IS REQUIRED OF US. ", " BUT WE CAN GET OFF-LINE AND  EXPLAIN THAT PROCESS. ", " &gt;&gt; COUPLE COMMENTS. ", " FOR CIVIL, JUST A PEOPLE  UNDERSTAND, WE ARE GOING TO BE  COLLECTING MORE IN TERMS OF THE  REVENUE FOR THE PARK DISTRICT  NEXT YEAR. ", " $53 MILLION VERSUS ABOUT 52  THIS YEAR. ", " THE ESTIMATED ASSESSED VALUE IS  ACTUALLY GOING TO BE $.21 PER ", " THOUSAND DOLLARS, WHICH IS ONE  CENT LESS THAN WHAT WE  COLLECTED LAST YEAR. ", " LAST YEAR, $.22. THAT IS ", " BECAUSE THE AV HAS GONE UP AND  WE'RE ABLE TO REDUCE THAT. ", " IN CASE PEOPLE THINK I'M GOING  TO SEE THIS BIG INCREASE IN MY  TAXES FOR THIS PARTICULAR PIECE  OF THE LEVY, PARKS LEVY, THAT  SHOULD NOT BE THE CASE. ", " &gt;&gt; ROUGHLY 51 TO 53 MILLION,  THE INCREASE SHIFT, DOES NOT  INCLUDE NEW CONSTRUCTION? ", " &gt;&gt; I THINK PART OF THAT  CHALLENGE TOO IS THAT WHEN THE  FIRST SIX-YEAR PARK DISTRICT  BUDGET WAS ADOPTED, IT WAS SET  AT A DOLLAR AMOUNT PER YEAR  WITH AN INFLATIONARY CAUSE. ", " THAT WAS ALL THE PROJECTS AND  THEIR. ", " IT DOES INCLUDE NEW  CONSTRUCTION, BUT THAT IS BEEN  SET SINCE IT WOULD IS ADOPTED  IN 2014 OR 2050. ", " THE REASON THE CHANGES IS  BECAUSE, ALTHOUGH THAT NUMBER  STAYS, THE BUDGET NUMBER STAYS  THE SAME, AS THE PROPERTY  VALUES GO UP, THE RATE CHANGES. ", " THE RATE WILL CHANGE, BUT OUR  BUDGET THAT IS BEEN APPROVED  ISN'T CHANGING . IT IS THE SAME ", " AMOUNT OF MONEY WE SAID WE  WOULD GET SIX YEARS AGO. ", " &gt;&gt; THERE ARE CLEARLY A NUMBER  OF WAYS FOLKS COULD CHOOSE TO  MEASURE WHAT WE ARE DOING WHEN  YOU ARE OVER THE NEXT. I THINK ", " PROBABLY THE MOST REAL WAY  WOULD BE FOR AN INDIVIDUAL TO  LOOK AT THEIR BILL AND SEE WHAT  THEY PAID THIS YEAR AND WHAT  THEY ARE PAYING NEXT YEAR. ", " AND THAT WILL FLUCTUATE BY A  NUMBER THINGS. ", " WHAT IS YOUR ASSESSED VALUE  CHANGES RELATIVE TO EVERYONE  ELSE'S IN THE CITY. ", " OUR RATE IS ACTUALLY GOING DOWN  FROM $.22 TO $.21. ", " THE TOTAL AMOUNT WE ARE  COLLECTING IS GOING UP  SLIGHTLY, A COUPLE OF  PERCENTAGE POINTS. ", " THAT ALSO REFLECTS THE FACT  THERE IS A LOT MORE VALUED IN  THE CITY TO COLLECT FROM. ", " DOESN'T NECESSARILY IMPLY AN  INDIVIDUAL WILL PAY. ", " BUT IF YOU'VE DONE A MAJOR  REMODEL THAT IS BEEN CAPTURED,  IT WOULD IMPROVE IT IF YOUR  PROPERTY VALUE IS GOING UP A  LOT HIGHER THAN YOUR NEIGHBORS  BECAUSE MAYBE IT IS OWNED A  CERTAIN WAY. ", " BUT PEOPLE ON THE OTHER SIDE  WILL SEE A LOWER PAYMENT NEXT  YEAR TOO. ", " OF THAT WILL VARY BY  INDIVIDUALS. ", " &gt;&gt; I SHOULD ADD BECAUSE THAT IS  WHAT WE ARE GOING TO LOOK AT  AND HAVE ROBUST ACTIVITY ABOUT  THE SIX-YEAR PLAN. ", " WE HAVE THIS NEXT YEAR TO  FINISH OUT, AND THEN WE PUT  TOGETHER A PLAN FOR THE NEXT  SIX YEARS, BUT WE'RE TRYING TO  DO IS BE TRUE TO WHAT THE  VOTERS ASK FOR IN 2014 ABOUT,  WE ALL VOTED FOR PARKS, CREATED  A METROPOLITAN PARK DISTRICT. ", " THAT IS WHERE THE CONFUSION IS. ", " PEOPLE CONFUSE THAT WITH THE  ACTUAL PARKS COMMITTEE, WHICH  IS SEPARATE. ", " THOUGH INTEGRATED AND WE TALK  TO EACH OTHER. ", " SO IT ISN'T THAT IT HASN'T  GOTTEN A NOTICE, WHEN DO WE  ANTICIPATE OUR SIX-YEAR PLAN  COMING OUT? ", " &gt;&gt; 21 AND BEYOND. ", " THAT IS THE WORK OF NEXT YEAR. ", " IT WILL BE PART OF THE NEXT  YEAR BUDGET THAT WILL INCLUDE  THE SIX-YEAR FINANCIAL PLAN. ", " &gt;&gt; AND WE WILL BE HAVING A  DISCUSSION ABOUT THE SIX-YEAR  PLAN AND COMMITTEE WHERE PEOPLE  CAN COME AND GIVE PUBLIC  COMMENT. ", " IT WILL BE POSTED JUST LIKE  WE'VE BEEN DOING FOR THE LAST  FOUR YEARS. ", " I JUST WANT PEOPLE TO BE CLEAR  ABOUT THAT. ", " ANYTHING ELSE? ", " &gt;&gt; SO THE METROPOLITAN PARK  DISTRICT BOARD WILL STAND  ADJOURNED. ", " THANK YOU."]